USE [service]
GO
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
-- ===================================================
-- Описание:	Отображение статистики
-- ===================================================
ALTER PROCEDURE [dbo].[Statistics]
AS
BEGIN
	SELECT AVG(DATEDIFF(DAY, дата_добавления, дата_окончания)) AS 'Среднее время выполнения заявки (в днях)'
		FROM Заявка
	SELECT COUNT(*) AS 'Выполнено заявок'
		FROM Заявка
		WHERE id_статуса = 3
	SELECT Тип_неисправности.имя_неисправности AS 'Тип неисправности',
		COUNT(Тип_неисправности.имя_неисправности) AS 'Количество'
	FROM   Заявка
	JOIN   Тип_неисправности
		ON  Заявка.id_неисправности = Тип_неисправности.id_неисправности
	GROUP BY Заявка.id_неисправности, Тип_неисправности.имя_неисправности
END
